anachrocomputer/PIC32Reach/blinky.X/blinky.c
    LATACLR = _LATA_LATA0_MASK;   // Assert SS for SPI3
    
    SPIBuf = buf;
    SPINbytes = nbytes;
    SPIDummyReads = nbytes;
    
    SPI3BUF = *SPIBuf++;          // Transmit first byte
    SPINbytes--;
    
    IFS2CLR = _IFS2_SPI3RXIF_MASK;  // Clear SPI3 Rx interrupt flag
    IEC2SET = _IEC2_SPI3RXIE_MASK;  // Enable SPI3 Rx interrupt
    
    if (SPINbytes > 0)
    {
        IFS2CLR = _IFS2_SPI3TXIF_MASK;  // Clear SPI3 Tx interrupt flag
        IEC2SET = _IEC2_SPI3TXIE_MASK;  // Enable SPI3 Tx interrupt
    }
    
    return (true);
}

int SPIbytesPending(void)
{
    return (SPIDummyReads);
}


static void I2C1_begin(const int speed)
{
    if (speed > 200)
    {
        I2C1BRG = 0x2c;     // 400kHz
    }
    else
    {
        I2C1BRG = 0xc2;     // 100kHz
    }
    
    I2C1CONSET = _I2C1CON_ON_MASK;  // Enable I2C1
}


/* I2C1_DevicePoll --- poll the I2C bus for a device at a given address */

static bool I2C1_DevicePoll(const uint8_t addr)
{
    bool found;

    I2C1CONSET = _I2C1CON_SEN_MASK; // Initiate start condition

    while (I2C1CONbits.SEN != 0)
        ;

    I2C1TRN = addr | 0x01; // Use I2C read address, D0 = 1

    while (I2C1STATbits.TRSTAT)
        ;

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        found = false;
    }
    else
    {
        found = true;
    }

    I2C1CONSET = _I2C1CON_PEN_MASK; // Initiate stop condition

    while (I2C1CONbits.PEN != 0)
        ;

    return (found);
}


/* I2C1_ReadIMU --- read ID register in MPU9250 IMU via I2C */

static uint8_t I2C1_ReadIMU(void)
{
    uint8_t regID;

    I2C1CONSET = _I2C1CON_SEN_MASK; // Initiate start condition

    while (I2C1CONbits.SEN != 0)
        ;

    I2C1TRN = 0xd0;

    while (I2C1STATbits.TRSTAT)
        ;

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        LED5 = 0;   // Light LED5 on NACK
    }
    else
    {
        LED5 = 1;
    }

    I2C1TRN = 117;  // MPU9250 WHOAMI register

    while (I2C1STATbits.TRSTAT)
        ;

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        LED5 = 0;   // Light LED5 on NACK
    }
    else
    {
        LED5 = 1;
    }

    I2C1CONSET = _I2C1CON_RSEN_MASK; // Initiate repeated start condition

    while (I2C1CONbits.RSEN != 0)
        ;

    I2C1TRN = 0xd1;

    while (I2C1STATbits.TRSTAT)
        ;

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        LED5 = 0;   // Light LED5 on NACK
    }
    else
    {
        LED5 = 1;
    }

    I2C1CONSET = _I2C1CON_RCEN_MASK; // Initiate receive mode

    while (I2C1STATbits.RBF == 0)
        ;

    regID = I2C1RCV;

    I2C1CONbits.ACKDT = 0;

    I2C1CONSET = _I2C1CON_ACKEN_MASK; // Send master ACK bit

    while (I2C1CONbits.ACKEN != 0)
        ;

    I2C1CONSET = _I2C1CON_PEN_MASK; // Initiate stop condition

    while (I2C1CONbits.PEN != 0)
        ;
    
    return (regID);
}


/* toneT2 --- generate a tone of the given frequency via Timer 2 and OC2 */

void toneT2(const int freq)
{
    if (freq == 0)
    {
        OC2RS = 0;
    }
    else
    {
        const int div = (40000000 / 64) / freq;
        PR2 = div;
        OC2RS = div / 2;
    }
}


/* PPS_begin --- map Peripheral Pin Select to suit dev board */

static void PPS_begin(void)
{
    /* Configure USART1 */
    RPE5Rbits.RPE5R = 3;    // U1Tx on pin 3, RPE5
    U1RXRbits.U1RXR = 10;   // U1Rx on pin 6, RPC1
    
    /* Configure USART2 */
    RPG0Rbits.RPG0R = 1;    // U2Tx on pin 90, RPG0
    U2RXRbits.U2RXR = 12;   // U2Rx on pin 89, RPG1 (5V tolerant)
    
    /* Configure USART3 */
    RPF1Rbits.RPF1R = 1;    // U3Tx on pin 88, RPF1
    U3RXRbits.U3RXR = 4;    // U3Rx on pin 87, RPF0
    
    /* Configure USART4 */
    RPD4Rbits.RPD4R = 2;    // U4Tx on pin 81, RPD4
    U4RXRbits.U4RXR = 6;    // U4Rx on pin 82, RPD5 (5V tolerant)
    
    /* Configure USART5 */
    RPD12Rbits.RPD12R = 4;  // U5Tx on pin 79, RPD12
    U5RXRbits.U5RXR = 0;    // U5Rx on pin 76, RPD1
    
    /* Configure OC pins (PWM) */
    RPD8Rbits.RPD8R = 12; // OC1 on P7 pin 10 (LED PWM)
    RPD0Rbits.RPD0R = 11; // OC2 on P7 pin 14 (tone)
    
    /* Configure SPI1 */
    // SCK1 on pin 70 RD10 - can't use on this PCB
    //SDI1Rbits.SDI1R = 0;   // SDI1 on RPD3
    //RPC13Rbits.RPC13R = 8; // SDO1 on RPC13
    
    /* Configure SPI2 */
    // SCK2 on pin 10, RG6, P1 pin 32
    SDI2Rbits.SDI2R = 0;   // SDI2 on RPD3, pin 78
    RPC13Rbits.RPC13R = 6; // SDO2 on RPC13, pin 73, P7 pin 16
    
    /* Configure SPI3 */
    // SCK3 on pin 39, RF13, P1 pin 15
    SDI3Rbits.SDI3R = 0;   // SDI3 on RPD2, pin 77
    RPG8Rbits.RPG8R = 14;  // SDO3 on RPG8, pin 12, P1 pin 28
    
    /* Configure SPI4 */
    // SCK4 on pin 48, RD15 blocked by Main current sense
    
    /* Configure I2C1 */
    // SCL1 on RA14, pin 66, P1 pin 19
    // SDA1 on RA15, pin 67, P1 pin 21
    
    /* Configure I2C2 */
    // SCL2 on RA2, pin 58, P7 pin 20
    // SDA2 on RA3, pin 59, P7 pin 22
}


/* TRIS_begin --- switch GPIO pins to input or output as required */

static void TRIS_begin(void)
{
    TRISEbits.TRISE6 = 0;   // LED1 pin 4 as output
    TRISEbits.TRISE7 = 0;   // LED2 pin 5 as output
    TRISEbits.TRISE1 = 0;   // LED3 pin 94 as output
    TRISAbits.TRISA7 = 0;   // LED4 pin 92 as output
    TRISAbits.TRISA6 = 0;   // LED5 pin 91 as output
    
    TRISGbits.TRISG15 = 0;  // U1EN pin 1 as output
    TRISEbits.TRISE2 = 0;   // U2EN pin 98 as output
    TRISGbits.TRISG12 = 0;  // U3EN pin 96 as output
    TRISDbits.TRISD13 = 0;  // U4EN pin 80 as output
    TRISDbits.TRISD11 = 0;  // U5EN pin 71 as output
    
    TRISEbits.TRISE3 = 1;   // U1FAULT pin 99 as input
    TRISGbits.TRISG13 = 1;  // U2FAULT pin 97 as input
    TRISGbits.TRISG14 = 1;  // U3FAULT pin 95 as input
    TRISDbits.TRISD3 = 1;   // U4FAULT pin 78 as input
    TRISDbits.TRISD10 = 1;  // U5FAULT pin 70 as input
    TRISFbits.TRISF5 = 1;   // Main current FAULT pin 50 as input
    TRISFbits.TRISF4 = 1;   // Motor current FAULT pin 49 as input
    
